custom_macron_map = {

    # Crases
    "τοὔνομα": "τοὔνομα^",

    # Articles and relative pronouns
    "τὰ": "τὰ^",
    "τὰς": "τὰ_ς",

    "ἃ": "ἃ^",

    # Nouns
    "γέφυρα": "γέφυ_ρα^",
    "πεδίον": "πεδί^ον",
    "πόλις": "πόλι^ς",
    "πόλιν": "πόλι^ν",
    "πόλι": "πόλι^",
    "πόλεσι": "πόλεσι^",
    "πόλεσιν": "πόλεσι^ν",
    "ποταμός": "ποτα^μός",
    "ποταμόν": "ποτα^μόν",

    # Copulae
    
    "εἰμί": "εἰμί^",
    "εἰμι": "εἰμι^",
    "ἔστι": "ἔστι^",
    "ἐστί": "ἐστί^",
    "ἐστι": "ἐστι^",
    "ἐστίν": "ἐστί^ν",
    "ἐστιν": "ἐστι^ν",

    "εἰσί": "εἰσί^",
    "εἰσι": "εἰσι^",
    "εἰσίν": "εἰσί^ν",
    "εἰσιν": "εἰσι^ν",

    "ἴσθι": "ἴσθι^",

    # Verbs

    # Adjectives
    
    "Ἀρκάς": "Ἀ^ρκά^ς",
    "Ἀρκάδι": "Ἀ^ρκά^δι^",
    "Ἑλληνικός": "Ἑλληνι^κός",
    "Ἑλληνικὴν": "Ἑλληνι^κὴν",
    "ἱκανοί": "ἱ^κα^νοί",
    "Λακεδαιμόνιος": "Λα^κεδαιμόνι^ος",
    "Μεγαρεύς": "Μεγα^ρεύς",
    "μυρίος": "μυ_ρί^ος",
    "μυρίοι": "μυ_ρί^οι",
    
    # Numerals

    "δέκα": "δέ^κα",
    "δύο": "δύ^ο",
    "ἑπτά": "ἑπτά^",
    "χίλιοι": "χί_λι^οι",
    "μύριοι": "μύ_ρι^οι",

    # Adverbs

    "ἅμα": "ἅ^μα^",
    "ἐνταῦθα": "ἐνταῦθα^",
    "ἔτι": "ἔτι^",
    "πάλιν": "πά^λι^ν",
    "παντάπασιν": "πα^ντά^πα_σι^ν",
    "τετρακισχίλιος": "τετρα^κι^σχί_λι^ος",
    "τετρακισχιλίους": "τετρα^κι^σχι_λί^ους",

    # Prepositions

    "ἀμφί": "ἀμφί^",
    "ἀμφὶ": "ἀμφὶ^",
    "ἀπό": "ἀ^πό",
    "ἀπὸ": "ἀ^πὸ",
    "διά": "δι^ά^",
    "διὰ": "δι^ὰ^",
    "ἐπί": "ἐπί^",
    "ἐπὶ": "ἐπὶ^",
    "κατά": "κα^τά^",
    "κατὰ": "κα^τὰ^",
    "παρά": "πα^ρά^",
    "παρὰ": "πα^ρὰ^",
    "περί": "περί^",
    "περὶ": "περὶ^",
    "σύν": "σύ^ν",
    "σὺν": "σὺ^ν",
    "ὑπό": "ὑ^πό",
    "ὑπὸ": "ὑ^πὸ",

    # Proper names

    "Ἀρκαδία": "Ἀ^ρκα^δί^α_",
    "Δαρεῖος": "Δα_ρεῖος",
    "Δαρείου": "Δα_ρείου",
    "Κύρου": "Κύ_ρου",
    "Κύρῳ": "Κύ_ρῳ",
    "Λυδία": "Λυ_δί^α_",
    "Λυδίας": "Λυ_δί^α_ς",
    "Μίλητος": "Μί_λητος",
    "Μιλήτου": "Μι_λήτου",
    "Μιλήτῳ": "Μι_λήτῳ",
    "Μίλητον": "Μί_λητον",
    "Ξενίας": "Ξενί^α_ς",
    "Ξενίᾳ": "Ξενί^ᾳ",
    "Ξενίαν": "Ξενί^α_ν",
    "Παρύσατις": "Πα^ρύ^σα_τι^ς", # Old Iranian *parušyāti-
    "Παρυσάτιδος": "Πα^ρυ^σά_τι^δος",
    "Σωκράτης": "Σωκρά^της",
    "Σωκράτους": "Σωκρά^τους",
    "Σωκράτει": "Σωκρά^τει",
    "Σωκράτη": "Σωκρά^τη",
    "Σωκράτην": "Σωκρά^την",
    "Σώκρατες": "Σώκρα^τες",
    "Τισσαφέρνης": "Τισσα^φέρνης", # Old Persian *Ciçafarnāh
    "Τισσαφέρνους": "Τισσα^φέρνους",
    "Τισσαφέρνει": "Τισσα^φέρνει",
    "Τισσαφέρνην": "Τισσα^φέρνην",

    # Subjunctions
    "ἀλλά": "ἀλλά^",
    "ἀλλὰ": "ἀλλὰ^",
    "γάρ": "γά^ρ",
    "γὰρ": "γὰ^ρ",
    "πρίν": "πρί^ν",
    "πρὶν": "πρὶ^ν"
}

def custom_macronizer(word):
    word = word.replace('^', '').replace('_', '')
    if word in custom_macron_map:
        return custom_macron_map[word]
    
    return word