custom_macron_map = {

    # Crases
    "τοὔνομα": "τοὔνομα^",

    # Articles and relative pronouns
    "τὰ": "τὰ^",
    "τὰς": "τὰ_ς",

    "ἃ": "ἃ^",

    # Nouns
    "γέφυρα": "γέφυ_ρα^",
    "πεδίον": "πεδί^ον",
    "πόλις": "πόλι^ς",
    "πόλιν": "πόλι^ν",
    "πόλι": "πόλι^",
    "πόλεσι": "πόλεσι^",
    "πόλεσιν": "πόλεσι^ν",
    "ποταμός": "ποτα^μός",
    "ποταμόν": "ποτα^μόν",

    # Verbs
    
    "εἰμί": "εἰμί^",
    "εἰμι": "εἰμι^",
    "ἔστι": "ἔστι^",
    "ἐστί": "ἐστί^",
    "ἐστι": "ἐστι^",
    "ἐστίν": "ἐστί^ν",
    "ἐστιν": "ἐστι^ν",

    "εἰσί": "εἰσί^",
    "εἰσι": "εἰσι^",
    "εἰσίν": "εἰσί^ν",
    "εἰσιν": "εἰσι^ν",

    "ἴσθι": "ἴσθι^",

    # Adjectives
    
    "Ἀρκαδία": "Ἀ^ρκα^δί^α_",
    "Ἀρκάς": "Ἀ^ρκά^ς",
    "Ἑλληνικός": "Ἑλληνι^κός",
    "Ἑλληνικὴν": "Ἑλληνι^κὴν",
    "ἱκανοί": "ἱ^κα^νοί",
    "Λακεδαιμόνιος": "Λα^κεδαιμόνι^ος",
    "Μεγαρεύς": "Μεγα^ρεύς",
    
    "δύο": "δύ^ο",
    "χίλιοι": "χί_λι^οι",

    # Adverbs

    "ἅμα": "ἅ^μα^",
    "ἐνταῦθα": "ἐνταῦθα^",
    "παντάπασιν": "πα^ντά^πα_σι^ν",
    "τετρακισχίλιος": "τετρα^κι^σχί_λι^ος",
    "τετρακισχιλίους": "τετρα^κι^σχι_λί^ους",

    # Prepositions

    "ἀπό": "ἀ^πό",
    "ἀπὸ": "ἀ^πὸ",
    "διά": "δι^ά^",
    "διὰ": "δι^ὰ^",
    "κατά": "κα^τά^",
    "κατὰ": "κα^τὰ^",

    # Proper names
    "Δαρεῖος": "Δα_ρεῖος",
    "Δαρείου": "Δα_ρείου",
    "Κύρου": "Κύ_ρου",
    "Κύρῳ": "Κύ_ρῳ",
    "Λυδία": "Λυ_δί^α_",
    "Λυδίας": "Λυ_δί^α_ς",
    "Μίλητος": "Μί_λητος",
    "Μιλήτου": "Μι_λήτου",
    "Μιλήτῳ": "Μι_λήτῳ",
    "Μίλητον": "Μί_λητον",
    "Ξενίας": "Ξενί^α_ς",
    "Ξενίαν": "Ξενί^α_ν",
    "Παρύσατις": "Πα^ρύ^σα_τι^ς", # Old Iranian *parušyāti-
    "Παρυσάτιδος": "Πα^ρυ^σά_τι^δος",
    "Σωκράτης": "Σωκρά^της",
    "Σωκράτους": "Σωκρά^τους",
    "Σωκράτει": "Σωκρά^τει",
    "Σωκράτη": "Σωκρά^τη",
    "Σωκράτην": "Σωκρά^την",
    "Σώκρατες": "Σώκρα^τες",
    "Τισσαφέρνης": "Τισσα^φέρνης", # Old Persian *Ciçafarnāh
    "Τισσαφέρνους": "Τισσα^φέρνους",
    "Τισσαφέρνην": "Τισσα^φέρνην"
}

def custom_macronizer(word):
    word = word.replace('^', '').replace('_', '')
    if word in custom_macron_map:
        return custom_macron_map[word]
    
    return word