custom_macron_map = {

    # Crases
    "τοὔνομα": "τοὔνομα^",
    "κἀκ": "κἀ_κ",

    # Articles

    "ἁ": "ἁ_", # doric ἡ
    "τὰ": "τὰ^",
    "τὰς": "τὰ_ς",

     # Pronouns (Personal, Demonstrative, Relative, Interrogative)

    # Relative pronouns

    "ἃ": "ἃ^", # NOTE could be mixed up with doric!
    "ἅς": "ἅ_ς",
    "ἃς": "ἃ_ς",

    # Interrogative pronouns

    "τίς": "τί^ς",
    "τί": "τί^",
    "τίνος": "τί^νος",
    "τίνι": "τί^νι^",
    "τίνα": "τί^να^",

    "τίνε": "τί^νε",
    "τίνοιν": "τί^νοιν",

    "τίνες": "τί^νες",
    "τίνων": "τί^νων",
    "τίσι": "τί^σι^",
    "τίσιν": "τί^σι^ν",
    "τίνα^ς": "τί^να^ς",
    
    "τις": "τι^ς",
    "τι": "τι^",
    "τινός": "τι^νός",
    "τινὸς": "τι^νὸς",
    "τινος": "τι^νος",
    "τινί": "τι^νί^",
    "τινὶ": "τι^νὶ^",
    "τινι": "τι^νι^",
    "τινά": "τι^νά^",
    "τινὰ": "τι^νὰ^",
    "τινα": "τι^να^",
    
    "τινές": "τι^νές",
    "τινὲς": "τι^νὲς",
    "τινες": "τι^νες",
    "τινῶν": "τι^νῶν",
    "τινων": "τι^νων",
    "τισί": "τισί",
    "τισὶ": "τισὶ",
    "τισι": "τισι",
    "τισίν": "τισίν",
    "τισὶν": "τισὶν",
    "τισιν": "τισιν",
    "τινάς": "τι^νάς",
    "τινὰς": "τι^νὰς",
    "τινας": "τι^νας",

    # Nouns
    
    "ἁγίασμα": "ἁ^γί^α^σμα^",
    "ἆσθμα": "ἆσθμα^",
    "βασιλεῖ": "βα^σι^λεῖ",
    "βασιλέως": "βα^σι^λέως",
    "γέφυρα": "γέφυ_ρα^",
    "θάλατταν": "θά^λα^ττα^ν",
    "πάροδος": "πά^ροδος",
    "πεδίον": "πεδί^ον",
    "παρασάγγης": "πα^ρα_σάγγης",
    "παρασάγγας": "πα^ρα_σάγγα_ς",
    "πόλις": "πόλι^ς",
    "πόλιν": "πόλι^ν",
    "πόλι": "πόλι^",
    "πόλεσι": "πόλεσι^",
    "πόλεσιν": "πόλεσι^ν",
    "ποταμός": "ποτα^μός",
    "ποταμόν": "ποτα^μόν",
    "στρατηγός": "στρα^τηγός",
    "στρατηγὸς": "στρα^τηγὸς",
    "στρατιᾶς": "στρα^τι^ᾶς",
    "στρατιᾷ": "στρα^τι^ᾷ",
    "στρατιαν": "στρα^τι^α_ν",

    # Copulae
    
    "εἰμί": "εἰμί^",
    "εἰμι": "εἰμι^",
    "ἔστι": "ἔστι^",
    "ἐστί": "ἐστί^",
    "ἐστι": "ἐστι^",
    "ἔστιν": "ἔστι^ν",
    "ἐστίν": "ἐστί^ν",
    "ἐστιν": "ἐστι^ν",

    "εἰσί": "εἰσί^",
    "εἰσι": "εἰσι^",
    "εἰσίν": "εἰσί^ν",
    "εἰσιν": "εἰσι^ν",

    "ἴσθι": "ἴσθι^",

    # Verbs

    # Adjectives
    
    "Ἀρκάς": "Ἀ^ρκά^ς",
    "Ἀρκάδι": "Ἀ^ρκά^δι^",
    "Ἑλληνικός": "Ἑλληνι^κός",
    "Ἑλληνικὴν": "Ἑλληνι^κὴν",
    "ἱκανοί": "ἱ^κα^νοί",
    "Λακεδαιμόνιος": "Λα^κεδαιμόνι^ος",
    "Μεγαρεύς": "Μεγα^ρεύς",
    "μυρίος": "μυ_ρί^ος",
    "μυρίοι": "μυ_ρί^οι",
    "πιτυίνη": "πι^τυ^ί^νη", # interesting example of word that if not written with ¨ in feminine looks like a macronized diphthong
    "πιτυΐνη": "πι^τυ^ΐ^νη",
    
    # Numerals

    "δέκα": "δέ^κα",
    "δύο": "δύ^ο",
    "ἑπτά": "ἑπτά^",
    "μύριοι": "μύ_ρι^οι",
    "τριάκοντα": "τρι^ά_κοντα^",
    "χίλιοι": "χί_λι^οι",

    # Adverbs

    "ἅμα": "ἅ^μα^",
    "αὐτόθι": "αὐτόθι^",
    "ἐνταῦθα": "ἐνταῦθα^",
    "ἔτι": "ἔτι^",
    "μάλιστα": "μά^λι^στα^",
    "πάλιν": "πά^λι^ν",
    "παντάπασιν": "πα^ντά^πα_σι^ν",
    "τετρακισχίλιος": "τετρα^κι^σχί_λι^ος",
    "τετρακισχιλίους": "τετρα^κι^σχι_λί^ους",

    # Particles

    "τοίνυν": "τοίνυ^ν",

    # Prepositions

    "ἀμφί": "ἀμφί^",
    "ἀμφὶ": "ἀμφὶ^",
    "ἀπό": "ἀ^πό",
    "ἀπὸ": "ἀ^πὸ",
    "διά": "δι^ά^",
    "διὰ": "δι^ὰ^",
    "ἐπί": "ἐπί^",
    "ἐπὶ": "ἐπὶ^",
    "κατά": "κα^τά^",
    "κατὰ": "κα^τὰ^",
    "ξὺν": "ξὺ^ν",
    "παρά": "πα^ρά^",
    "παρὰ": "πα^ρὰ^",
    "περί": "περί^",
    "περὶ": "περὶ^",
    "σύν": "σύ^ν",
    "σὺν": "σὺ^ν",
    "ὑπό": "ὑ^πό",
    "ὑπὸ": "ὑ^πὸ",
    "ὑφ'": "ὑ^φ'",
    "ὑφ": "ὑ^φ",

    # Proper names

    "Ἀβροκόμας": "Ἀβροκόμα_ς",
    "Ἀρκαδία": "Ἀ^ρκα^δί^α_",
    "Δαρεῖος": "Δα_ρεῖος",
    "Δαρείου": "Δα_ρείου",
    "Κιλικία": "Κι^λι^κί^α_",
    "Κύρου": "Κύ_ρου",
    "Κύρῳ": "Κύ_ρῳ",
    "Λυδία": "Λυ_δί^α_",
    "Λυδίας": "Λυ_δί^α_ς",
    "Μίλητος": "Μί_λητος",
    "Μιλήτου": "Μι_λήτου",
    "Μιλήτῳ": "Μι_λήτῳ",
    "Μίλητον": "Μί_λητον",
    "Ξενίας": "Ξενί^α_ς",
    "Ξενίᾳ": "Ξενί^ᾳ",
    "Ξενίαν": "Ξενί^α_ν",
    "Παρύσατις": "Πα^ρύ^σα_τι^ς", # Old Iranian *parušyāti-
    "Παρυσάτιδος": "Πα^ρυ^σά_τι^δος",
    "Σωκράτης": "Σωκρά^της",
    "Σωκράτους": "Σωκρά^τους",
    "Σωκράτει": "Σωκρά^τει",
    "Σωκράτη": "Σωκρά^τη",
    "Σωκράτην": "Σωκρά^την",
    "Σώκρατες": "Σώκρα^τες",
    "Τισσαφέρνης": "Τισσα^φέρνης", # Old Persian *Ciçafarnāh
    "Τισσαφέρνους": "Τισσα^φέρνους",
    "Τισσαφέρνει": "Τισσα^φέρνει",
    "Τισσαφέρνην": "Τισσα^φέρνην",
    "Χειρίσοφος": "Χειρί^σοφος",
    "Χειρίσοφον": "Χειρί^σοφον",

    # Subjunctions
    "ἀλλά": "ἀλλά^",
    "ἀλλὰ": "ἀλλὰ^",
    "γάρ": "γά^ρ",
    "γὰρ": "γὰ^ρ",
    "ἐάν": "ἐά^ν",
    "ἐὰν": "ἐὰ^ν",
    "πρίν": "πρί^ν",
    "πρὶν": "πρὶ^ν",

    # More "Anabasis Middle"
    "βασιλέα": "βα^σι^λέα^",
    "Θετταλός": "Θεττα^λός",
    "Θετταλὸς": "Θεττα^λὸς",
    "Θετταλόν": "Θεττα^λόν",
    "Θετταλὸν": "Θεττα^λὸν",
    "Φρυγία": "Φρυ^γί^α_",
    "Φρυγίας": "Φρυ^γί^α_ς",
    "ἀγῶνος": "ἀ^γῶνος",
    "ἀγῶνι": "ἀ^γῶνι^",
    "ἀγῶνα": "ἀ^γῶνα^",
    "ἀντιστασιωτῶν": "ἀντι^στα^σι^ωτῶν",
    "Αἰνιᾶνας": "Αἰνι^ᾶνα^ς",
    "Βοιώτιον": "Βοιώτι^ον",
    "Θετταλίᾳ": "Θεττα^λί^ᾳ",
    "Κελαινάς": "Κελαινά_ς",
    "Κολοσσάς": "Κολοσσά_ς",
    "Λύκαια": "Λύ^καια^",
    "Μαρσύας": "Μαρσύ_α^ς", # Nonnos D. 1, 42
    "Μαρσύαν": "Μαρσύ_α^ν",
    "Πέλτας": "Πέλτα_ς"
}

def custom_macronizer(word):
    word = word.replace('^', '').replace('_', '')
    if word in custom_macron_map:
        return custom_macron_map[word]
    
    return word